const categoryItems =
document.querySelectorAll(".category-item");

const cards =
document.querySelectorAll(".food-card");

categoryItems.forEach(item=>{

    item.addEventListener("click",()=>{

        categoryItems.forEach(el=>
            el.classList.remove("active"));

        item.classList.add("active");

        const filter =
        item.dataset.filter;

        cards.forEach(card=>{

            if(filter === "all"){
                card.style.display = "block";
            }
            else if(card.classList.contains(filter)){
                card.style.display = "block";
            }
            else{
                card.style.display = "none";
            }

        });

    });

});

const menuData = {

    burger: {
        title: "🍔 قائمة البركر",
        items: [
            ["بركر لحم عادي","2.500"],
            ["بركر دجاج","2.500"],
            ["بركر لحم عراقي","3.500"],
            ["بانيه لحم","4.000"],
            ["بانيه دجاج","4.000"],
            ["سموك بركر + ببسي","5.000"],
            ["لايك بركر","5.000"],
            ["بركر شاورما لحم","5.000"],
            ["بركر لحم عراقي 2XL","5.000"],
            ["بركر محشي جبن + ببسي","6.000"],
            ["بركر لحم عراقي 3XL","7.000"],
            ["وجبة بركر + ببسي + فنكر + مقبلات","5.000"]
        ]
    },

    kentucky: {
        title: "🍗 قائمة الكنتاكي",
        items: [
            ["وجبة كنتاكي مني","5.000"],
            ["وجبة كنتاكي صغير","7.000"],
            ["وجبة كنتاكي وسط M","9.000"],
            ["وجبة كنتاكي وسط XL","11.000"],
            ["وجبة كنتاكي كبير","15.000"],
            ["وجبة كنتاكي جامبو","21.000"],
            ["وجبة كنتاكي سوبر","35.000"],
            ["إضافة قطعة كنتاكي","2.500"]
        ]
    },

    shawarma: {
        title: "🌯 قائمة الشاورما",
        items: [
            ["سندويش شاورما دجاج","2.000"],
            ["صاج دجاج","2.500"],
            ["سندويش شاورما لحم","3.000"],
            ["صاج لحم","3.500"],
            ["ربع كص دجاج","5.000"],
            ["ربع كص لحم","8.000"],
            ["نص كيلو دجاج","10.000"],
            ["نص كيلو كص لحم","15.000"],
            ["وجبة سندويش + ببسي + فنكر + مقبلات","5.000"]
        ]
    },

    crispy: {
        title: "🍟 قائمة الكرسبي",
        items: [
            ["وجبة كرسبي صغير","5.000"],
            ["وجبة كرسبي وسط","7.000"],
            ["وجبة كرسبي عائلي","10.000"],
            ["وجبة كرسبي سوبر","20.000"]
        ]
    },

    fried: {
        title: "🔥 دجاج مقرمش",
        items: [
            ["دجاجة مقرمشة مع التمن","15.000"],
            ["وجبة دجاج مقرمش","15.000"],
            ["دجاج مقرمش","13.000"]
        ]
    },

    rizo: {
        title: "🍚 قائمة الريزو",
        items: [
            ["ريزو كلاسك + ببسي صغير","5.000"],
            ["ريزو مدخن + ببسي صغير","5.000"],
            ["ريزو سبايسي + ببسي صغير","5.000"],
            ["ريزو شاورما دجاج + ببسي صغير","5.000"],
            ["ريزو مكس صوص + ببسي صغير","5.000"],
            ["ريزو جبن + ببسي صغير","6.000"],
            ["ريزو شاورما دجاج بالجبن + ببسي صغير","6.000"],
            ["ريزو شاورما لحم + ببسي صغير","6.000"],
            ["ريزو مكس لحم + ببسي صغير","6.000"],
            ["ريزو هلابينو + ببسي صغير","6.000"],
            ["ريزو شاورما لحم بالجبن + ببسي صغير","7.000"],
            ["ريزو عائلي + ببسي وسط + مقبلات وسط","12.000"]
        ]
    },

    snack: {
        title: "🍟 قائمة السناك",
        items: [
            ["تويستر صاج","3.500"],
            ["زنكر عادي","3.500"],
            ["زنكر سبايسي","3.500"],
            ["زنكر باربيكيو","3.500"],
            ["سكالوب دجاج","3.500"],
            ["فاهيتا دجاج","3.500"],
            ["ستيك دجاج","3.500"],
            ["زنكر جبن","4.000"],
            ["سندويش سوبريم","4.000"],
            ["فاهيتا لحم","4.500"],
            ["زنكر تريل + ببسي","5.000"],
            ["وجبة سندويش + ببسي + فنكر + مقبلات","5.000"]
        ]
    },

    pizza: {
        title: "🍕 قائمة الإيطالي",
        items: [
            ["بيتزا خضار (صغير)","5.000"],
            ["بيتزا خضار (وسط)","7.000"],
            ["بيتزا خضار (كبير)","10.000"],

            ["بيتزا ماركريتا (صغير)","5.000"],
            ["بيتزا ماركريتا (وسط)","7.000"],
            ["بيتزا ماركريتا (كبير)","9.000"],

            ["بيتزا دجاج (صغير)","5.000"],
            ["بيتزا دجاج (وسط)","7.000"],
            ["بيتزا دجاج (كبير)","10.000"],

            ["بيتزا بيروني (صغير)","5.000"],
            ["بيتزا بيروني (وسط)","7.000"],
            ["بيتزا بيروني (كبير)","10.000"],

            ["بيتزا لحم (صغير)","5.000"],
            ["بيتزا لحم (وسط)","8.000"],
            ["بيتزا لحم (كبير)","12.000"],

            ["بيتزا طابقين دجاج","13.000"],
            ["بيتزا طابقين لحم","14.000"],
            ["وجبة بيتزا","15.000"],
            ["صاج إيطالي","6.000"],
            ["سترومبولي","8.000"],
            ["لغم بركر","8.000"],
            ["لغم شاورما دجاج","8.000"],
            ["لغم شاورما لحم","10.000"]
        ]
    },

    finger: {
        title: "🍟 قائمة الفنكر",
        items: [
            ["فنكر صغير","1.000"],
            ["فنكر وسط","2.000"],
            ["فنكر بالجبن","3.000"],
            ["بطاطا وجز","1.000"],
            ["فنكر وسط بالجبن","4.000"],
            ["فنكر جبن موزريلا","4.000"],
            ["فنكر فرايز كلاسك","4.500"],
            ["فرايز شاورما الدجاج","4.500"],
            ["فرايز شاورما اللحم","4.500"],
            ["فنكر عائلي","5.000"],
            ["إضافة هلابينو / مدخن / جبن شيدر / سبايسي","500"]
        ]
    },

    appetizer: {
        title: "🥗 قائمة المقبلات",
        items: [
            ["مقبلات صغير","1.000"],
            ["مقبلات وسط","2.000"],
            ["مقبلات كبير","3.000"],
            ["سلطة سيزر","5.000"],
            ["ببسي","500"],
            ["لبن","500"],
            ["شاي","500"],
            ["ماء","250"]
        ]
    },

    juice: {
        title: "🍹 قائمة العصائر",
        items: [
            ["عصير برتقال","1.000"],
            ["عصير ليمون","1.000"],
            ["عصير ليمون ونعناع","1.000"],
            ["عصير موز","1.000"],
            ["عصير برتقال وليمون","1.000"],
            ["عصير بطيخ","1.000"],
            ["عصير كيوي","1.000"],
            ["عصير موز بالنوتيلا","2.000"],
            ["عصير أناناس","2.000"],
            ["عصير فراولة","2.000"],
            ["عصير موز وفراولة","2.000"],
            ["عصير دبل","2.000"],
            ["عصير لايك","3.000"]
        ]
    },

    mojito: {
        title: "🧊 قائمة الموهيتو",
        items: [
            ["موهيتو فراولة","2.500"],
            ["موهيتو بلو بيري","2.500"],
            ["موهيتو بوز بيري","2.500"],
            ["موهيتو علك","2.500"],
            ["موهيتو ليمون ونعناع","2.500"],
            ["موهيتو كيوي","2.500"],
            ["موهيتو موز وفراولة","2.500"],
            ["موهيتو حمضيات","2.500"],
            ["موهيتو فانيلا","2.500"]
        ]
    },

    waffle: {
        title: "🧇 قائمة الوافل",
        items: [
            ["وافل نوتيلا M","3.000"],
            ["وافل نوتيلا XL","5.000"],
            ["وافل فواكه M","3.500"],
            ["وافل فواكه XL","5.500"],
            ["وافل لوتس M","3.500"],
            ["وافل لوتس XL","5.500"],
            ["وافل أوريو M","3.500"],
            ["وافل أوريو XL","5.500"],
            ["وافل بستاشيو M","3.500"],
            ["وافل بستاشيو XL","5.500"],
            ["وافل كندر M","3.500"],
            ["وافل كندر XL","5.500"],
            ["وافل كت كات M","3.500"],
            ["وافل كت كات XL","5.500"],
            ["وافل موز M","3.500"],
            ["وافل موز XL","5.500"],
            ["وافل مكس M","4.000"],
            ["وافل مكس XL","5.500"],
            ["وافل مكسرات M","4.000"],
            ["وافل مكسرات XL","5.500"]
        ]
    },

    pancake: {
        title: "🥞 قائمة البان كيك",
        items: [
            ["بان كيك نوتيلا","3.500"],
            ["بان كيك أوريو","4.000"],
            ["بان كيك لوتس","4.000"],
            ["بان كيك موز","4.000"],
            ["بان كيك بيتزا","5.000"],
            ["بان كيك كندر","5.000"],
            ["بان كيك كت كات","5.000"],
            ["بان كيك سنيكرز","5.000"],
            ["بان كيك بالكريمة والفستق","5.000"],
            ["بان كيك بركر","5.500"]
        ]
    },

    fruits: {
        title: "🍓 قائمة الفواكه",
        items: [
            ["طبق فواكه صغير","3.000"],
            ["طبق فواكه كبير","5.000"]
        ]
    },

    icecream: {
        title: "🍨 قائمة الآيس كريم",
        items: [
            ["آيس كريم صغير","1.000"],
            ["آيس كريم كبير","2.000"],
            ["نصف كيلو مشكل","6.000"],
            ["كيلو آيس كريم مشكل","12.000"]
        ]
    },

    coffee: {
        title: "☕ قائمة القهوة",
        items: [
            ["قهوة ساخنة","2.000"],
            ["آيس كوفي","3.000"]
        ]
    },

    crepe: {
        title: "🥐 قائمة الكريب",
        items: [
            ["كريب نوتيلا","3.000"],
            ["كريب موز","3.500"],
            ["كريب فواكه","4.000"],
            ["كريب فوتشيني","4.000"],
            ["كريب أوريو","4.000"],
            ["كريب لوتس","4.000"],
            ["كريب بنانا رول","4.000"],
            ["كريب بستاشيو","4.000"],
            ["كريب بالمكسرات","4.000"],
            ["كريب سوشي","4.000"],
            ["كريب مكس","4.500"],
            ["كريب فستق رول","5.000"],
            ["كريب لغم","5.000"],
            ["كريب كندر","5.000"],
            ["كريب كت كات","5.000"],
            ["كريب سنيكرز","5.000"],
            ["كريب سبشل براوني","6.000"]
        ]
    },

    milkshake: {
        title: "🥤 قائمة الميلك شيك",
        items: [
            ["ميلك شيك أوريو","3.000"],
            ["ميلك شيك لوتس","3.000"],
            ["ميلك شيك فراولة","3.000"],
            ["ميلك شيك بستاشيو","3.000"],
            ["ميلك شيك سنيكرز","3.000"],
            ["ميلك شيك كندر","3.000"],
            ["ميلك شيك كت كات","3.000"]
        ]
    }

};
function openMenu(category){

    const popup =
    document.getElementById("menuPopup");

    const title =
    document.getElementById("popupTitle");

    const content =
    document.getElementById("popupContent");

    title.innerHTML =
    menuData[category].title;

    content.innerHTML = "";

    menuData[category].items.forEach(meal=>{

        content.innerHTML += `

        <div class="popup-meal">

            <div>

                <h4>${meal[0]}</h4>

                <p class="popup-price">
                ${meal[1]} د.ع
                </p>

            </div>
            

            <a
            class="popup-whatsapp"
            target="_blank"
            href="https://wa.me/9647725558209?text=أريد طلب ${meal[0]}">

            اطلب الآن

            </a>

        </div>

        `;

    });

popup.style.display = "flex";
document.body.style.overflow = "hidden";
}

function closeMenu(){

    document.getElementById("menuPopup")
    .style.display = "none";

    document.body.style.overflow = "auto";
}

cards.forEach((card,i)=>{
    card.style.animationDelay = (i*0.1)+"s";
});

new Swiper(".foodSwiper",{
    slidesPerView:3,
    spaceBetween:20,
    navigation:{
        nextEl:".swiper-button-next",
        prevEl:".swiper-button-prev",
    },
    breakpoints:{
        768:{
            slidesPerView:5
        },
        1200:{
            slidesPerView:8
        }
    }
});

new Swiper(".drinkSwiper",{
    slidesPerView:3,
    spaceBetween:20,
    breakpoints:{
        768:{
            slidesPerView:5
        },
        1200:{
            slidesPerView:8
        }
    }
});

document.querySelectorAll(".category-item").forEach(item => {

    item.addEventListener("click", () => {

        const target = document.getElementById(item.dataset.target);

        if(target){

            target.scrollIntoView({
                behavior: "smooth",
                block: "center"
            });

            document.querySelectorAll(".category-card").forEach(card=>{
                card.classList.remove("highlight");
            });

            target.classList.add("highlight");

            setTimeout(()=>{
                target.classList.remove("highlight");
            },2000);
        }

    });

});